// 乐高课评库常量
const legao = { 
    content : [ 
        `宝贝的课堂表现特别好，在拼搭积木的过程中，还能够自己仔细观察成品，并且自己动手拼搭，观察能力和动手能力都不错，还能够给自己的机器人拼出不一样的造型，比较有自己的想法，不错，继续加油，继续加油，老师期待你更好的作品。`,
        `宝贝整堂课都表现得不错，很乖巧，能够积极回答老师的问题，在后面拼搭积木的过程中，也能够认真的观察成品，认真听老师讲课，自己动手一步步地把积木拼好了，很棒，在拼搭的过程中，还学会了固定积木的小技巧，最后分享的环节，也比较勇敢，棒棒哒，继续加油，老师期待你更好的作品。`,
        `宝贝他的观察能力很好，也很聪明，能够很快知道需要用到什么积木。搭积木的时候，表现的也很好，搭建的速度很快，在等别的小朋友的时候，他能自己根据模型搭出下一步，动手能力很棒哦，喜欢的话来编程猫，学习更多有趣的知识哦。`,
        `宝贝在课堂上表现得很好，积极配合老师，回答老师的问题，真棒，另外，宝贝的观察能力和动手能力还是不错的，他能够通过观察成品想象出一个基本的形状，然后有目的地拼出相似的形状出来，当做出来的作品和成品有一些出入时，宝贝在老师的指导下也能够马上纠正过来，棒棒哒。继续加油，老师期待你更好的作品。`,
        `宝贝很棒，很乖巧，能够积极回答老师的问题，在后面拼搭积木的过程中，也能够认真的观察成品，认真听老师讲课，自己动手一步步地把积木拼好了，很棒，在拼搭的过程中，还学会了固定积木的小技巧，棒棒哒，继续加油，老师期待你更好的作品。`,
        `宝贝很棒，很乖巧，能够积极回答老师的问题，在拼搭积木的过程中，也能够自己动手一步步做好，非常棒，后面增加旋转的时候，能够自己修改不同的速度和时间，学得很好，棒棒哒，要继续加油，喜欢的话来编程猫，创作更多有意思的作品哦。`
    ],
    head1 : `宝贝今天完成了`,
    head2 : `的作品，课程的目标主要有以下几点：`
}
// kitten课评库常量
const kitten = { 
    content : [ 
        `宝贝的课堂表现特别好，在拼搭积木的过程中，还能够自己仔细观察成品，并且自己动手拼搭，观察能力和动手能力都不错，还能够给自己的机器人拼出不一样的造型，比较有自己的想法，不错，继续加油，继续加油，老师期待你更好的作品。`,
        `宝贝整堂课都表现得不错，很乖巧，能够积极回答老师的问题，在后面拼搭积木的过程中，也能够认真的观察成品，认真听老师讲课，自己动手一步步地把积木拼好了，很棒，在拼搭的过程中，还学会了固定积木的小技巧，最后分享的环节，也比较勇敢，棒棒哒，继续加油，老师期待你更好的作品。`,
        `宝贝他的观察能力很好，也很聪明，能够很快知道需要用到什么积木。搭积木的时候，表现的也很好，搭建的速度很快，在等别的小朋友的时候，他能自己根据模型搭出下一步，动手能力很棒哦，喜欢的话来编程猫，学习更多有趣的知识哦。`,
        `宝贝在课堂上表现得很好，积极配合老师，回答老师的问题，真棒，另外，宝贝的观察能力和动手能力还是不错的，他能够通过观察成品想象出一个基本的形状，然后有目的地拼出相似的形状出来，当做出来的作品和成品有一些出入时，宝贝在老师的指导下也能够马上纠正过来，棒棒哒。继续加油，老师期待你更好的作品。`,
        `宝贝很棒，很乖巧，能够积极回答老师的问题，在后面拼搭积木的过程中，也能够认真的观察成品，认真听老师讲课，自己动手一步步地把积木拼好了，很棒，在拼搭的过程中，还学会了固定积木的小技巧，棒棒哒，继续加油，老师期待你更好的作品。`,
        `宝贝很棒，很乖巧，能够积极回答老师的问题，在拼搭积木的过程中，也能够自己动手一步步做好，非常棒，后面增加旋转的时候，能够自己修改不同的速度和时间，学得很好，棒棒哒，要继续加油，喜欢的话来编程猫，创作更多有意思的作品哦。`
    ],
    head1 : `宝贝今天完成了`,
    head2 : `的作品，课程的目标主要有以下几点：`
}
// python课评库常量
const python = { 
    content : [ 
        `宝贝的课堂表现特别好，在拼搭积木的过程中，还能够自己仔细观察成品，并且自己动手拼搭，观察能力和动手能力都不错，还能够给自己的机器人拼出不一样的造型，比较有自己的想法，不错，继续加油，继续加油，老师期待你更好的作品。`,
        `宝贝整堂课都表现得不错，很乖巧，能够积极回答老师的问题，在后面拼搭积木的过程中，也能够认真的观察成品，认真听老师讲课，自己动手一步步地把积木拼好了，很棒，在拼搭的过程中，还学会了固定积木的小技巧，最后分享的环节，也比较勇敢，棒棒哒，继续加油，老师期待你更好的作品。`,
        `宝贝他的观察能力很好，也很聪明，能够很快知道需要用到什么积木。搭积木的时候，表现的也很好，搭建的速度很快，在等别的小朋友的时候，他能自己根据模型搭出下一步，动手能力很棒哦，喜欢的话来编程猫，学习更多有趣的知识哦。`,
        `宝贝在课堂上表现得很好，积极配合老师，回答老师的问题，真棒，另外，宝贝的观察能力和动手能力还是不错的，他能够通过观察成品想象出一个基本的形状，然后有目的地拼出相似的形状出来，当做出来的作品和成品有一些出入时，宝贝在老师的指导下也能够马上纠正过来，棒棒哒。继续加油，老师期待你更好的作品。`,
        `宝贝很棒，很乖巧，能够积极回答老师的问题，在后面拼搭积木的过程中，也能够认真的观察成品，认真听老师讲课，自己动手一步步地把积木拼好了，很棒，在拼搭的过程中，还学会了固定积木的小技巧，棒棒哒，继续加油，老师期待你更好的作品。`,
        `宝贝很棒，很乖巧，能够积极回答老师的问题，在拼搭积木的过程中，也能够自己动手一步步做好，非常棒，后面增加旋转的时候，能够自己修改不同的速度和时间，学得很好，棒棒哒，要继续加油，喜欢的话来编程猫，创作更多有意思的作品哦。`
    ],
    head1 : `宝贝今天完成了`,
    head2 : `的作品，课程的目标主要有以下几点：`
}

/**
 * 课评头部
 * @param {*} name 
 * @param {*} title 
 * @param {*} mode 
 */
const get_head = (name, title, mode) => {
    switch(mode) {
        case 0:
            return name + legao.head1 + title + legao.head2;
        case 1:
            return name + kitten.head1 + title + kitten.head2;
        case 2: 
            return name + python.head1 + title + python.head2;
        default:
            return ;
    }
};

/**
 * 课评内容
 * @param {*} name 
 * @param {*} title 
 * @param {*} mode 
 */
const get_content = (name, mode) => {
    let content = [];
    switch(mode) {
        case 0:
            content = legao.content;
            break;
        case 1:
            content = kitten.content;
            break;
        case 2: 
            content = python.content;
            break;
        default:
            break;
    }
    return `${name + content[Math.random() * content.length]}`;
}

/**
 * 增加学生模块
 * @param {*} ev 
 */
const addStuModule = (ev) => {
    debugger
    ev = ev || window.event;
    const obj = ev.srcElement || ev.target;
    console.log(obj);
}